[
    {
        "date": "2015-12-17",
        "dream": "I had a dream the other night that Kyle katarn was in the new [Star Wars] movie haha, don't tell me if he is or isn't"
    },
    {
        "date": "2016-01-05",
        "dream": "all of us were in a car going down the motorway and we went into this service station like stripclub slash gambling place but loads of weird shit was going on. Like people were betting on which goat would stand up the longest and women dancing on really high bar stools \n We all got creeped out so legged it out because we didn't pay for something, got in a car and it didnt start. Got surrounded by all these horrible security guards and they punched the car in \n So they chased us through countryside for what seemed like hours \n Sacha was driving so he probably left the handbrake on \n thats why it didnt move hah"
    },
    {
        "date": "2016-01-09",
        "dream": "Basically I was up at 6 for a bit then fell back to sleep, woke up thinking I had shit the bed. Remember looking at my bed for ages and panicking then I realised I was dreaming and tried to head for my door soon as it opened, I was still dreaming but I knew I wasn't in control"
    },
    {
        "date": "2016-01-24",
        "dream": "Basically me and blue was out shopping for cd's and sofas at this shop that was a mix of hmv and dfs, we find the cd I wanted and we bump into sacha, said he'll buy us a new sofa and drop it off later. Me and blue are back at this house wherever it is, and we're talking about sachas nephew who is 5 and apparently a comedy genius according to blue, and blue is trying to be his agent too. Said he was just like a character called george from seinfeld. All of a sudden this kid burts in with a short sleeve shirt tucked in and big fucking glasses, shouting all sorts of shit then he suddenly leaves. Realised the little cunt had stolen my laptop and my phone and sacha hadnt really dropped off the sofa. I ran to sachas car which was a jeep and said your cunt of a little nephew just stole my laptop. Sacha said well I did say I would buy him one eventually, so can't he just use this for a bit? I get in the back of the car whilst sacha is driving and I wrestle this 5 year old for my laptop and phone, I end up falling out of the car whilst its driving without my laptop and thats the end!"
    },
    {
        "date": "2016-01-30",
        "dream": "Had a dream I went shopping in Aldi with Paul McCartney and some Nigerian man kept calling me Andrew so I turned around and punched him, then the security guard came and sorted it all out. Turned out he was a barber too and gave me one of those barber style shaves"
    },
    {
        "date": "2016-02-28",
        "dream": "Was getting chased by a werewolf up a building and I was sort of climbing on little roofs and extensions, it's chasing me then suddenly transforms back to a man, he falls to the floor but his lower part of his body shows that he is disabled and has very tiny legs. I told him to fuck off and kicked him off the roof"
    },
    {

    }
]